//
// Created by semyon on 11.06.19.
//

#ifndef BREAKOUT_MAP_H
#define BREAKOUT_MAP_H


#include <SFML/System/String.hpp>

using namespace sf;




const int HEIGHT_MAP = 25;//размер карты высота
const int WIDTH_MAP = 40;//размер карты ширина

//TODO:подсказки по символам на карте:
// 0 - блок
// 1 - граница экрана
// s - пустота чтобы правая граница стала на свое место

sf::String TileMap[HEIGHT_MAP] = {
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "0000000000000000000000000000000000000000",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
        "                                        ",
};


#endif //BREAKOUT_MAP_H
